## Plan Result (sbox-shutter)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;idam-user-dashboard&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;idam-user-dashboard&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;idam-user-dashboard&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-user-dashboard&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["idam-user-dashboard"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-idam-user-dashboard-shutter-sbox"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-idam"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-sbox-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = (known after apply)
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["idam-user-dashboard"] will be created
  + resource "azurerm_storage_account" "shutter_store" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "hmctsidamusershuttersbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "shutter-app-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["idam-user-dashboard"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "idam-user-dashboard"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "idam-user-dashboard.sandbox.platform.hmcts.net"
          + "name"     = "hmcts-shutter-idam/hmcts-idam-user-dashboard-shutter-sbox/idam-user-dashboard-sandbox-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-sbox-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-user-dashboard"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "5010f45244694bd69ced681d9aa2f85f"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1245,"Program":"tfcmt","SHA1":"","Target":"sbox-shutter","Vars":{}} -->